/*
 * File: FillRaw.java
 * ----------------------------
 * FillRaw დაეხმარება კარელს, შეავსოს ქუჩა ბიპერებით,
 * რომელზედაც ის ამჟამად იმყოფება.
 * 
 * ამოცანის პირობა:
 * კარელი დგას 1x1 უჯრაზე, შეავსებინეთ მას პირველი ქუჩა ბრილიანტებით. ანუ პირველი
 * ქუჩის ყველა უჯრაზე უნდა იდოს ზუსტად ერთი ბრილიანტი. ჩათვალეთ რომ საწყის
 * სამყაროში ბრილიანტები არსად არ დევს.
 */

import stanford.karel.*;

public class FillRaw extends SuperKarel {

	public void run() {
        // მანამ სანამ კარელს მის წინ არ შეხვდება წინაღობა,
        // მან უნდა განაგრძოს სიარული ქუჩის ბოლომდე.
		while(frontIsClear()) {
            // ქუჩაში მოძრაობასთან ერთად იგი დებს ბიპერებს
            putBeeper();
            // ბიპერის დადების შემდგომ გადადის მომდევნო უჯრაზე
            move();
        }
        // გავითვალისწინოთ Off-by-one error
        // დამატებით ამის შესახებ იხილეთ /problem-set/FillRaw.md ფაილში
        putBeeper();
	}
	
}
